# parameters
nc: 1  # number of classes
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]   # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  # Two Stream
  [
    ######### TransformerBlock One #############
    # stream one
    [-1, 1, InitConv, [64, 3, 2]],    # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, C2f, [128,True]],   # 2-P2/4
    [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
    [-1, 9, C2f, [256,True]],   # 4-P3/8
    # stream two
    [-4, 1, InitConv1, [64, 3, 2]],    # 5-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 6-P2/4
    [-1, 3, C2f, [128,True]],   # 7-P2/4
    [-1, 1, Conv, [256, 3, 2]],  # 8-P3/8
    [-1, 9, C2f, [256,True]],   # 9-P3/8

    
    ######### TransformerBlock Two #############
   # transformer fusion
    [[4,9], 1, chnnel_swapping_Vmamba, [256,1]],   # 10-P3/8
    [-1, 1, CrossLayer, [256, 8]],#11
    [[4,11], 1, Add2, [256,0]],    # 12-P3/8 stream one x+trans[0]
    [[9,11], 1, Add2, [256,1]],    # 13-P3/8 stream two x+trans[1]


   ######### TransformerBlock Three #############
   # stream one
    [12, 1, Conv, [512, 3, 2]],   # 14-P4/16
    [-1, 9, C2f, [512,True]],   # 15-P4/16
   # stream two
    [13, 1, Conv, [512, 3, 2]],   # 16-P4/16
    [-1, 9, C2f, [512,True]],   # 17-P4/16
   # transformer fusion
    [[15,17], 1, chnnel_swapping_Vmamba, [512, 1]],#18
    [-1, 1, CrossLayer, [512,8]],   # 19-P3/8
    [[15,19], 1, Add2, [512,0]],    # 20-P3/8 stream one x+trans[0]
    [[17,19], 1, Add2, [512,1]],    # 21-P3/8 stream two x+trans[1]


    ######### TransformerBlock Four #############
    # stream one
    [20, 1, Conv, [1024, 3, 2]],    # 22-P5/32
    [-1, 1, SPPF, [1024, 5]],   # 23-P5/32
    [-1, 3, C2f, [1024, False]],   # 24-P5/32
    # stream two
    [21, 1, Conv, [1024, 3, 2]],    # 25-P5/32
    [-1, 1, SPPF, [1024, 5]],   # 26-P5/32
    [-1, 3, C2f, [1024, False]],   # 27-P5/32
    # transformer fusion
    [[24,27], 1, chnnel_swapping_Vmamba, [1024, 1]],#28
    [-1, 1, CrossLayer, [1024,8]],    # 29-P5/32
    [[24,29], 1, Add2, [1024,0]],    # 30-P5/32 stream one x+trans[0]
    [[27,29], 1, Add2, [1024,1]],    # 31-P5/32 stream two x+trans[1]


    ######### Add Block #############
    [[12,13], 1, Add, [1]],   # 32-P3/8 fusion backbone P3
    [[20,21], 1, Add, [1]],   # 33-P4/16 fusion backbone P4
    [[30,31], 1, Add, [1]],   # 34-P5/32 fusion backbone P5

  ]


# YOLOv5 head
head:
  [
    [-1, 1, Conv, [512, 1, 1]],   # 35
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 36
    [[-1,33], 1, Concat, [1]],    # 37 cat backbone P4
    [-1, 3, C2f, [512]],    # 38

    [-1, 1, Conv, [256, 1, 1]],   # 39
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 40
    [[-1,32], 1, Concat, [1]],    # 41 cat backbone P3
    [-1, 3, C2f, [256]],    # 42 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],   # 43
    [[-1,39], 1, Concat, [1]],    # 44 cat head P4
    [-1, 3, C2f, [512]],    # 45 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],    # 46
    [[-1,34], 1, Concat, [1]],     # 47 cat head P5
    [-1, 3, C2f, [1024]],     # 48 (P5/32-large)

    [[42, 45, 48], 1, Detect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
